sh/readme.org
# -*- mode: org ; coding: utf-8-unix -*-
# last updated : 2021/05/02.17:57:06


#+TITLE:     LLVM Build Shell by bash
#+AUTHOR:    yaruopooner [https://github.com/yaruopooner]
#+OPTIONS:   author:nil timestamp:t |:t \n:t ^:nil


* Usage
  This script builds LLVM for Linux or Cygwin.
  llvm-builder.sh is the script itself.
  sample.sh is a call sample.
  Please edit it if necessary, for example the patch path.

* Requirements
  The following is required.

** Git
   #+begin_src shell-script
     $ sudo apt-get install git
   #+end_src

** CMake
   #+begin_src shell-script
     $ sudo apt-get install cmake
   #+end_src

   If you want to use the latest version, please download from the following URL.

   http://www.cmake.org/

   download latest cmake, decompress, build and install.
   
   #+begin_src shell-script
     $ wget --timestamping https://cmake.org/files/v3.6/cmake-3.6.2-win64-x64.zip
     $ tar -xvf cmake-3.6.2.tar.gz
     $ cd cmake-3.6.2
     $ ./configure && make
     $ make install
   #+end_src

** Python 3.6.x
   Required from LLVM 12.0.X.

** Python 2.7.x
   Required up to LLVM 11.0.X.

* Self Build
  Use Bash version.

  llvm-build-shells performs the following steps.
  - LLVM repository clone and checkout
  - Apply patch(optional)
  - Makefile generation by cmake
  - Build
    
** Patch
   You need to set the path of the patch in sample.sh.

   [[../patch/details.org][Patch Details]]
